; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	infrared4 - mode
	thermograph2 - mode
	thermograph5 - mode
	spectrograph6 - mode
	thermograph3 - mode
	thermograph0 - mode
	infrared1 - mode
	Star2 - direction
	GroundStation4 - direction
	Star3 - direction
	Star1 - direction
	GroundStation0 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared4)
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph6)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star1)
	(supports instrument2 thermograph5)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(have_image Star5 infrared4)
	(have_image Star6 infrared1)
	(have_image Planet7 thermograph5)
	(have_image Planet7 thermograph0)
	(have_image Star8 infrared4)
	(have_image Star8 thermograph5)
	(have_image Star9 thermograph2)
	(have_image Star9 thermograph5)
	(have_image Star10 thermograph2)
	(have_image Star10 thermograph5)
	(have_image Star11 spectrograph6)
	(have_image Phenomenon12 thermograph2)
	(have_image Phenomenon12 infrared1)
	(have_image Phenomenon13 thermograph5)
	(have_image Phenomenon13 thermograph0)
	(have_image Star14 infrared4)
))

)

; plan
1. (turn_to satellite1 star1 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star1)
   goals met: 0 of 17
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 17
3. (calibrate satellite1 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 0 of 17
4. (turn_to satellite1 star9 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star9)
   goals met: 0 of 17
5. (take_image satellite1 star9 instrument1 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 1 of 17
6. (turn_to satellite1 star6 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star6)
   goals met: 1 of 17
7. (take_image satellite1 star6 instrument1 infrared1)
   added: (have_image star6 infrared1)
   goals met: 2 of 17
8. (turn_to satellite1 star10 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star10)
   goals met: 2 of 17
9. (take_image satellite1 star10 instrument1 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 3 of 17
10. (turn_to satellite1 phenomenon12 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 17
11. (turn_to satellite0 star3 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star3)
   goals met: 3 of 17
12. (take_image satellite1 phenomenon12 instrument1 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 4 of 17
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 17
14. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 4 of 17
15. (take_image satellite1 phenomenon12 instrument1 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 5 of 17
16. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 5 of 17
17. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 5 of 17
18. (turn_to satellite0 phenomenon13 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 17
19. (take_image satellite0 phenomenon13 instrument0 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 6 of 17
20. (turn_to satellite0 planet7 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet7)
   goals met: 6 of 17
21. (take_image satellite0 planet7 instrument0 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 7 of 17
22. (turn_to satellite0 star11 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star11)
   goals met: 7 of 17
23. (take_image satellite0 star11 instrument0 spectrograph6)
   added: (have_image star11 spectrograph6)
   goals met: 8 of 17
24. (turn_to satellite0 star14 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star14)
   goals met: 8 of 17
25. (take_image satellite0 star14 instrument0 infrared4)
   added: (have_image star14 infrared4)
   goals met: 9 of 17
26. (turn_to satellite0 star5 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star5)
   goals met: 9 of 17
27. (take_image satellite0 star5 instrument0 infrared4)
   added: (have_image star5 infrared4)
   goals met: 10 of 17
28. (turn_to satellite0 star8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star8)
   goals met: 10 of 17
29. (take_image satellite0 star8 instrument0 infrared4)
   added: (have_image star8 infrared4)
   goals met: 11 of 17
30. (turn_to satellite0 groundstation0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation0)
   goals met: 12 of 17
31. (turn_to satellite1 groundstation0 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 groundstation0)
   goals met: 12 of 17
32. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 12 of 17
33. (turn_to satellite1 phenomenon13 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon13)
   goals met: 12 of 17
34. (take_image satellite1 phenomenon13 instrument2 thermograph5)
   added: (have_image phenomenon13 thermograph5)
   goals met: 13 of 17
35. (turn_to satellite1 planet7 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet7)
   goals met: 13 of 17
36. (take_image satellite1 planet7 instrument2 thermograph5)
   added: (have_image planet7 thermograph5)
   goals met: 14 of 17
37. (turn_to satellite1 star10 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star10)
   goals met: 14 of 17
38. (take_image satellite1 star10 instrument2 thermograph5)
   added: (have_image star10 thermograph5)
   goals met: 15 of 17
39. (turn_to satellite1 star8 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star8)
   goals met: 15 of 17
40. (take_image satellite1 star8 instrument2 thermograph5)
   added: (have_image star8 thermograph5)
   goals met: 16 of 17
41. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 16 of 17
42. (take_image satellite1 star9 instrument2 thermograph5)
   added: (have_image star9 thermograph5)
   goals met: 17 of 17
